In [16]:
# Dependencias
import pandas as pd
from sklearn.linear_model import LogisticRegression

In [22]:
# Lectura y Limpieza
datos = pd.read_csv("../dataset/titanic.csv")
datos = datos.drop(columns=['deck'])

In [23]:
datos = datos[['survived','sex','age']]
datos

     survived     sex   age
0           0    male  22.0
1           1  female  38.0
2           1  female  26.0
3           1  female  35.0
4           0    male  35.0
..        ...     ...   ...
886         0    male  27.0
887         1  female  19.0
888         0  female   NaN
889         1    male  26.0
890         0    male  32.0

[891 rows x 3 columns]

In [24]:
datos = datos.dropna()
datos.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 890
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  714 non-null    int64
 1   sex       714 non-null    object
 2   age       714 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 22.3+ KB

In [25]:
# Generar dummies
datos_dummies = pd.get_dummies(datos, drop_first=True)
datos_dummies

     survived   age  sex_male
0           0  22.0         1
1           1  38.0         0
2           1  26.0         0
3           1  35.0         0
4           0  35.0         1
..        ...   ...       ...
885         0  39.0         0
886         0  27.0         1
887         1  19.0         0
889         1  26.0         1
890         0  32.0         1

[714 rows x 3 columns]

In [26]:
# Generar modelo
X = datos_dummies.drop(columns='survived')
y = datos_dummies['survived']
modelo = LogisticRegression()
modelo.fit(X,y)
modelo.score(X,y)

0.7801120448179272

In [27]:
# Hacer predicciones
simulacion = pd.DataFrame({
    'age': [20,30],
    'sex_male': [1, 0]
})

In [28]:
modelo.predict(simulacion)

array([0, 1], dtype=int64)